Autodesk.Revit.DB.ExternalService.IExternalData
The base interface for data classes used when executing servers of external services.
Remarks:
Each and every external service defines a concrete class derived from this interface
and adds data and methods as it sees fit for executions of such a particular service.
Since:
2013